// Вопросы

// 1
// Вопрос: Получения элемента по индексу из массива
// Ответ: array[i]

// 2
// Вопрос: Длинна массива
// Ответ: array.length

// 3
// Вопрос: Методы добавления/удаления в/из массива
// Ответ:
// push - добавляет элемент в конец массива
// pop - удаляет элемент из конца массива
// unshift - удаляет элемент из начала массива
// shift - вставляет элемент в начало массива

// 4
// Вопрос: Методы перебора массива
// Ответ:
// let fruits = ["Яблоко", "Апельсин", "Слива"];

// let arr = ["Яблоко", "Апельсин", "Груша"];

// for (let i = 0; i < arr.length; i++) {
//   alert( arr[i] );
// }

// проходит по значениям
// for (let fruit of fruits) {
//     alert( fruit );
//   }

// 5
// Вопрос: Самый простой способ очистить массив
// Ответ: array.length = 0
