// Вопросы

// 1
// Вопрос: Что такое унарный оператор?
// Ответ: Оператор который применяется к одному операнду

// 2
// Вопрос: Что будет при "моя" + "строка", "1" + "строка", 4 + 4 +"1"?
// Ответ: "моястрока", "1строка", "81"

// 3
// Вопрос: Что будет при "6" - "2", "6" / "23?
// Ответ: 4, 3

// 4
// Вопрос: Что будет при +"6", +true, +""?
// Ответ: 6, 1, 0

// 5
// Вопрос: Что такое инкремент и декремент?
// Ответ: ++ инкремент, --декремент

// 6
// Вопрос: Отличие префиксной и постфиксной формы?
// Ответ: Префиксная форма возвращает новое значение, постфиксная старое

// Пример
// let counter = 1;
// let a = ++counter;

// alert(a); //2

// let counter = 1;
// let a = counter++;

// alert(a); //1

// Задачи
// "" + 1 + 0
// "" - 1 + 0
// true + false
// 6 / "3"
// "2" * "3"
// 4 + 5 + "px"
// "$" + 4 + 5
// "4" - 2
// "4px" - 2
// 7 / 0
// "  -9  " + 5
// "  -9  " - 5
// null + 1
// undefined + 1
// " \t \n" - 2

// "10"
// -1
// 1
// 2
// 6
// "9px"
// "$45"
// 2
// Nan
// Infinity
// " -9 5"
// -14
// 1
// Nan
// -2
