// Вопросы

// 1
// Вопрос: Как js сравнивает строки?
// Ответ: Дальше в алфавите больше, строчная больше заглавной, в согласии с Unicode

// 2
// Вопрос: Отличие строгого и нестрого сравненния?
// Ответ: Первое преобразует к числу и сравнивает, второе сравнивает без привиденния типов

// 3
// Вопрос: Что будет при сравненни null == undefined, null === undefined?
// Ответ: true, false

// 4
// Вопрос: null == 0?
// Ответ:  false

// 5
// Вопрос: Сравнимо ли undefined с другими значениями?
// Ответ:  Нет
